# SetCntrlPtVis

## Description
```pascal
PROCEDURE SetCntrlPtVis(
				inCustomObj     : HANDLE;
				inContrlPtIndex : INTEGER;
				inIsVisible     : BOOLEAN);
```

```python

def vs.SetCntrlPtVis(inCustomObj, inContrlPtIndex, inIsVisible):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inCustomObj|HANDLE||
|inContrlPtIndex|INTEGER||
|inIsVisible|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events